Repository: franzholz/transactor
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: da, de

# error_feature_class
source: ERROR: Could not find the class %s for the feature %s.
da: FEJL: Kunne ikke finde klassen %s for funktionen %s.
de: FEHLER: Die Klasse %s für das Feature %s konnte nicht gefunden werden.

# error_feature_class_interface
source: ERROR: The feature class %s does not fit the required interface.
da: FEJL: Funktionsklasse %s passer ikke til den påkrævede grænseflade.
de: FEHLER: Die Feature Klasse %s passt nicht zum geforderten Interface.

# error_gateway_missing
source: ERROR: Could not find gateway object for payment method '|'.
da: FEJL: Kunne ikke finde gateway objekt for betalingsmetode '|'.
de: FEHLER: Es konnte kein Gateway Objeḱt für die Bezahlmethode '|' erzeugt werden.

# error_gateway_unknown
source: ERROR: Unknown failure after Gateway processing!
da: FEJL: Ukendt fejl efter Gateway behandling!
de: FEHLER: Unbekannter Fehler nach der Bearbeitung durch den Gateway!

# error_no_template
source: ERROR: The payment template file "%s" has not been found.
da: FEJL: Betalingsskabelonfilen "%s" er ikke blevet fundet.
de: FEHLER: Die Bezahlung Template Datei "%s" wurde nicht gefunden.

# error_transaction_init
source: ERROR: Could not initialize transaction.
da: FEJL: Kunne ikke initialisere transaktionen.
de: FEHLER: Die Transaktion konnte nicht gestartet werden.

# error_reference_id
source: ERROR: reference ID could not be generated.
da: FEJL: Reference ID kunne ikke genereres.
de: FEHLER: Es konnte keine Referenz ID erzeugt werden.

# error_transaction_details
source: ERROR: Setting details of transaction failed.
da: FEJL: Indstilling af detaljer om transaktionen mislykkedes.
de: FEHLER: Das Setzen der Details der Transaktion ist fehlgeschlagen.

# error_transaction_no
source: ERROR: No transaction has been executed.
da: FEJL: Ingen transaktion er blevet udført.
de: FEHLER: Es ist keine Transaktion durchgeführt worden.

# error_relay_url
source: ERROR: No relay URL given!
da: FEJL: Ingen relæ-URL angivet!
de: FEHLER: Es ist keine Weiterleitungs-URL angegeben worden!

# error_api_parameters
source: ERROR: Wrong parameter in the call of the Transactor API.
da: FEJL: Forkert parameter i opkaldet af Transaktor API.
de: FEHLER: Falscher Parameter beim Aufruf der Transactor API.

source: ERROR: invalid data.
da: FEJL: Ugyldige data.
de: FEHLER: ungültige Daten.

# extension_payment_missing
source: ERROR: No extension has been configured for the payment method.
da: FEJL: Ingen udvidelse er konfigureret til betalingsmetoden.
de: FEHLER: Es ist keine Extension als Bezahlmethode konfiguriert worden.

# extension_missing
source: ERROR: The extension '|' has not been installed.
da: FEJL: Udvidelsen '|' er ikke blevet installeret.
de: FEHLER: Die Extension '|' wurde nicht installiert.

# feature_address_input
source: address input
de: Adresseingabe
